abdosalem490/stm32f407-drivers/drivers/HAL/RCC/RCC_reg.h
/******************************************************************************
 * Preprocessor Constants
 *******************************************************************************/

/**
 * @brief: this is the base address of RCC registers used to configure some of the RCC behaviors
 * @note: it will be referred to as @HAL_RCC_BASE_ADDR
 */
#define HAL_RCC_OFFSET 0x00003800 /**< this is the offset of the RCC register from AHB1 bus base address*/

/**
 * @brief: RCC clock control register (RCC_CR), Reset value: 0x0000 XX83 where X is undefined.
 */
#define HAL_RCC_CR_PLLI2SRDY 27 /**< PLLI2S clock ready flag. Set by hardware to indicate that the PLLI2S is locked.*/
#define HAL_RCC_CR_PLLI2SON 26  /**< PLLI2S enable. Set and cleared by software to enable PLLI2S. Cleared by hardware when entering Stop or Standby mode. */
#define HAL_RCC_CR_PLLRDY 25    /**< Main PLL (PLL) clock ready flag. Set by hardware to indicate that PLL is locked.*/
#define HAL_RCC_CR_PLLON 24     /**< Main PLL (PLL) enable. Set and cleared by software to enable PLL. Cleared by hardware when entering Stop or Standby mode. This bit cannot be reset if PLL clock is used as the system clock.*/
#define HAL_RCC_CR_CSSON 19     /**< Clock security system enable. Set and cleared by software to enable the clock security system. When CSSON is set, the clock detector is enabled by hardware when the HSE oscillator is ready, and disabled by hardware if an oscillator failure is detected.*/
#define HAL_RCC_CR_HSEBYP 18    /**< HSE clock bypass. Set and cleared by software to bypass the oscillator with an external clock. The external clock must be enabled with the HSEON bit, to be used by the device. The HSEBYP bit can be written only if the HSE oscillator is disabled.*/
#define HAL_RCC_CR_HSERDY 17    /**< HSE clock ready flag. Set by hardware to indicate that the HSE oscillator is stable. After the HSEON bit is cleared, HSERDY goes low after 6 HSE oscillator clock cycles.*/
#define HAL_RCC_CR_HSEON 16     /**< HSE clock enable. Set and cleared by software. Cleared by hardware to stop the HSE oscillator when entering Stop or Standby mode. This bit cannot be reset if the HSE oscillator is used directly or indirectly as the system clock.*/
#define HAL_RCC_CR_HSICAL 8     /**< Internal high-speed clock calibration. These bits are initialized automatically at startup.*/
#define HAL_RCC_CR_HSITRIM 3    /**< Internal high-speed clock trimming. These bits provide an additional user-programmable trimming value that is added to the HSICAL[7:0] bits. It can be programmed to adjust to variations in voltage and temperature that influence the frequency of the internal HSI RC.*/
#define HAL_RCC_CR_HSIRDY 1     /**< Internal high-speed clock ready flag. Set by hardware to indicate that the HSI oscillator is stable. After the HSION bit is cleared, HSIRDY goes low after 6 HSI clock cycles.*/
#define HAL_RCC_CR_HSION 0      /**< Internal high-speed clock enable. Set and cleared by software. Set by hardware to force the HSI oscillator ON when leaving the Stop or Standby mode or in case of a failure of the HSE oscillator used directly or indirectly as the system clock. This bit  cannot be cleared if the HSI is used directly or indirectly as the system clock.*/

/**
 * @brief: RCC PLL configuration register (RCC_PLLCFGR), Reset value:0x2400 3010.
 */
#define HAL_RCC_PLLCFGR_PLLQ 24   /**< Main PLL (PLL) division factor for USB OTG FS, SDIO and random number generator clocks. Set and cleared by software to control the frequency of USB OTG FS clock, the random number generator clock and the SDIO clock. These bits should be written only if PLL is disabled.*/
#define HAL_RCC_PLLCFGR_PLLSRC 22 /**< Main PLL(PLL) and audio PLL (PLLI2S) entry clock source. Set and cleared by software to select PLL and PLLI2S clock source. This bit can be written only when PLL and PLLI2S are disabled.*/
#define HAL_RCC_PLLCFGR_PLLP 16   /**< Main PLL (PLL) division factor for main system clock. Set and cleared by software to control the frequency of the general PLL output clock. These bits can be written only if PLL is disabled.*/
#define HAL_RCC_PLLCFGR_PLLN 6    /**< Main PLL (PLL) multiplication factor for VCO. Set and cleared by software to control the multiplication factor of the VCO. These bits can be written only when PLL is disabled. Only half-word and word accesses are allowed to write these bits.*/
#define HAL_RCC_PLLCFGR_PLLM 0    /**< Division factor for the main PLL (PLL) and audio PLL (PLLI2S) input clock. Set and cleared by software to divide the PLL and PLLI2S input clock before the VCO. These bits can be written only when the PLL and PLLI2S are disabled.*/

/**
 * @brief: RCC clock configuration register (RCC_CFGR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_CFGR_MCO2 30    /**< Microcontroller clock output 2. Set and cleared by software. Clock source selection may generate glitches on MCO2. It is highly recommended to configure these bits only after reset before enabling the external oscillators and the PLLs.*/
#define HAL_RCC_CFGR_MCO2PRE 27 /**< MCO2 prescaler. Set and cleared by software to configure the prescaler of the MCO2. Modification of this prescaler may generate glitches on MCO2. It is highly recommended to change this prescaler only after reset before enabling the external oscillators and the PLLs.*/
#define HAL_RCC_CFGR_MCO1PRE 24 /**< MCO1 prescaler. Set and cleared by software to configure the prescaler of the MCO1. Modification of this prescaler may generate glitches on MCO1. It is highly recommended to change this prescaler only after reset before enabling the external oscillators and the PLL.*/
#define HAL_RCC_CFGR_I2SSRC 23  /**< I2S clock selection. Set and cleared by software. This bit allows to select the I2S clock source between the PLLI2S clock and the external clock. It is highly recommended to change this bit only after  reset and before enabling the I2S module.*/
#define HAL_RCC_CFGR_MCO1 21    /**< Microcontroller clock output 1. Set and cleared by software. Clock source selection may generate glitches on MCO1. It is highly recommended to configure these bits only after reset before enabling the external oscillators and PLL.*/
#define HAL_RCC_CFGR_RTCPRE 16  /**< HSE division factor for RTC clock. Set and cleared by software to divide the HSE clock input clock to generate a 1 MHz clock for RTC.*/
#define HAL_RCC_CFGR_PPRE2 13   /**< APB high-speed prescaler (APB2). Set and cleared by software to control APB high-speed clock division factor.*/
#define HAL_RCC_CFGR_PPRE1 10   /**< APB Low speed prescaler (APB1). Set and cleared by software to control APB low-speed clock division factor.*/
#define HAL_RCC_CFGR_HPRE 4     /**< AHB prescaler. Set and cleared by software to control AHB clock division factor. */
#define HAL_RCC_CFGR_SWS 2      /**< System clock switch status. Set and cleared by hardware to indicate which clock source is used as the system clock.*/
#define HAL_RCC_CFGR_SW 0       /**< System clock switch. Set and cleared by software to select the system clock source. Set by hardware to force the HSI selection when leaving the Stop or Standby mode or in case of failure of the HSE oscillator used directly or indirectly as the system clock.*/

/**
 * @brief: RCC clock interrupt register (RCC_CIR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_CIR_CSSC 23        /**< Clock security system interrupt clear. This bit is set by software to clear the CSSF flag.*/
#define HAL_RCC_CIR_PLLI2SRDYC 21  /**< PLLI2S ready interrupt clear. This bit is set by software to clear the PLLI2SRDYF flag.*/
#define HAL_RCC_CIR_PLLRDYC 20     /**< Main PLL(PLL) ready interrupt clear. This bit is set by software to clear the PLLRDYF flag.*/
#define HAL_RCC_CIR_HSERDYC 19     /**< HSE ready interrupt clear. This bit is set by software to clear the HSERDYF flag.*/
#define HAL_RCC_CIR_HSIRDYC 18     /**< HSI ready interrupt clear. This bit is set software to clear the HSIRDYF flag.*/
#define HAL_RCC_CIR_LSERDYC 17     /**< LSE ready interrupt clear. This bit is set by software to clear the LSERDYF flag.*/
#define HAL_RCC_CIR_LSIRDYC 16     /**< LSI ready interrupt clear. This bit is set by software to clear the LSIRDYF flag.*/
#define HAL_RCC_CIR_PLLI2SRDYIE 13 /**< PLLI2S ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by PLLI2S lock.*/
#define HAL_RCC_CIR_PLLRDYIE 12    /**< Main PLL (PLL) ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by PLL lock.*/
#define HAL_RCC_CIR_HSERDYIE 11    /**< HSE ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by the HSE oscillator stabilization.*/
#define HAL_RCC_CIR_HSIRDYIE 10    /**< HSI ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by the HSI oscillator stabilization.*/
#define HAL_RCC_CIR_LSERDYIE 9     /**< LSE ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by the LSE oscillator stabilization.*/
#define HAL_RCC_CIR_LSIRDYIE 8     /**< LSI ready interrupt enable. Set and cleared by software to enable/disable interrupt caused by LSI oscillator stabilization.*/
#define HAL_RCC_CIR_CSSF 7         /**< Clock security system interrupt flag. Set by hardware when a failure is detected in the HSE oscillator. Cleared by software setting the CSSC bit.*/
#define HAL_RCC_CIR_PLLI2SRDYF 6   /**< PLLI2S ready interrupt flag. Set by hardware when the PLLI2S locks and PLLI2SRDYDIE is set. Cleared by software setting the PLLRI2SDYC bit.*/
#define HAL_RCC_CIR_PLLRDYF 4      /**< Main PLL (PLL) ready interrupt flag. Set by hardware when PLL locks and PLLRDYDIE is set. Cleared by software setting the PLLRDYC bit.*/
#define HAL_RCC_CIR_HSERDYF 3      /**< HSE ready interrupt flag. Set by hardware when External High Speed clock becomes stable and HSERDYDIE is set. Cleared by software setting the HSERDYC bit.*/
#define HAL_RCC_CIR_HSIRDYF 2      /**< HSI ready interrupt flag. Set by hardware when the Internal High Speed clock becomes stable and HSIRDYDIE is set. Cleared by software setting the HSIRDYC bit.*/
#define HAL_RCC_CIR_LSERDYF 1      /**< LSE ready interrupt flag. Set by hardware when the External Low Speed clock becomes stable and LSERDYDIE is  set. Cleared by software setting the LSERDYC bit.*/
#define HAL_RCC_CIR_LSIRDYF 0      /**< LSI ready interrupt flag. Set by hardware when the internal low speed clock becomes stable and LSIRDYDIE is set. Cleared by software setting the LSIRDYC bit.*/

/**
 * @brief: bit definitions for RCC AHB1 peripheral reset register (RCC_AHB1RSTR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_AHB1RSTR_OTGHSRST 29  /**< USB OTG HS module reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_ETHMACRST 25 /**< Ethernet MAC reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_DMA2RST 22   /**< DMA2 reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_DMA1RST 21   /**< DMA1 reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_CRCRST 12    /**< CRC reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOIRST 8   /**<  IO port I reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOHRST 7   /**<  IO port H reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOGRST 6   /**<  IO port G reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOFRST 5   /**<  IO port F reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOERST 4   /**<  IO port E reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIODRST 3   /**<  IO port D reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOCRST 2   /**<  IO port C reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOBRST 1   /**<  IO port B reset. Set and cleared by software.*/
#define HAL_RCC_AHB1RSTR_GPIOARST 0   /**<  IO port A reset. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB2 peripheral reset register (RCC_AHB2RSTR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_AHB2RSTR_OTGFSRST 7 /**< USB OTG FS module reset. Set and cleared by software.*/
#define HAL_RCC_AHB2RSTR_RNGRST 6   /**< Random number generator module reset. Set and cleared by software.*/
#define HAL_RCC_AHB2RSTR_HASHRST 5  /**< Hash module reset. Set and cleared by software.*/
#define HAL_RCC_AHB2RSTR_CRYPRST 4  /**< Cryptographic module reset. Set and cleared by software.*/
#define HAL_RCC_AHB2RSTR_DCMIRST 0  /**< Camera interface reset. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB3 peripheral reset register (RCC_AHB3RSTR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_AHB3RSTR_FSMCRST 0 /**< Flexible static memory controller module reset. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC APB1 peripheral reset register (RCC_APB1RSTR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_APB1RSTR_DACRST 29    /**< DAC reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_PWRRST 28    /**< Power interface reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_CAN2RST 26   /**< CAN2 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_CAN1RST 25   /**< CAN1 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_I2C3RST 23   /**< I2C3 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_I2C2RST 22   /**< I2C2 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_I2C1RST 21   /**< I2C1 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_UART5RST 20  /**< UART5 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_UART4RST 19  /**< UART4 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_USART3RST 18 /**< USART3 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_USART2RST 17 /**< USART2 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_SPI3RST 15   /**< SPI3 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_SPI2RST 14   /**< SPI2 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_WWDGRST 11   /**< Window watchdog reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM14RST 8   /**< TIM14 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM13RST 7   /**< TIM13 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM12RST 6   /**< TIM12 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM7RST 5    /**< TIM7 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM6RST 4    /**< TIM6 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM5RST 3    /**< TIM5 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM4RST 2    /**< TIM4 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM3RST 1    /**< TIM3 reset. Set and cleared by software.*/
#define HAL_RCC_APB1RSTR_TIM2RST 0    /**< TIM2 reset. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC APB2 peripheral reset register (RCC_APB2RSTR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_APB2RSTR_TIM11RST 18  /**< TIM11 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_TIM10RST 17  /**< TIM10 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_TIM9RST 16   /**< TIM9 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_SYSCFGRST 14 /**< System configuration controller reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_SPI1RST 12   /**< SPI1 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_SDIORST 11   /**< SDIO reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_ADCRST 8     /**< ADC interface reset (common to all ADCs). Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_USART6RST 5  /**< USART6 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_USART1RST 4  /**< USART1 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_TIM8RST 1    /**< TIM1 reset. Set and cleared by software.*/
#define HAL_RCC_APB2RSTR_TIM1RST 0    /**< TIM8 reset. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB1 peripheral clock enable register (RCC_AHB1ENR), Reset value: 0x0010 0000.
 */
#define HAL_RCC_AHB1ENR_OTGHSULPIEN 30  /**< USB OTG HSULPI clock enable. Set and cleared by software. This bit must be cleared when the OTG_HS is used in FS mode.*/
#define HAL_RCC_AHB1ENR_OTGHSEN 29      /**< USB OTG HS clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_ETHMACPTPEN 28  /**< Ethernet PTP clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_ETHMACRXEN 27   /**< Ethernet Reception clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_ETHMACTXEN 26   /**< Ethernet Transmission clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_ETHMACEN 25     /**< Ethernet MAC clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_DMA2EN 22       /**< DMA2 clock enable. Set and cleared by software..*/
#define HAL_RCC_AHB1ENR_DMA1EN 21       /**< DMA1 clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_CCMDATARAMEN 20 /**< CCM data RAM clock enable. Set and cleared by software.  */
#define HAL_RCC_AHB1ENR_BKPSRAMEN 18    /**< Backup SRAM interface clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_CRCEN 12        /**< CRC clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB1ENR_GPIOIEN 8       /**< IO port I clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOHEN 7       /**< IO port H clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOGEN 6       /**< IO port G clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOFEN 5       /**< IO port F clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOEEN 4       /**< IO port E clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIODEN 3       /**< IO port D clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOCEN 2       /**< IO port C clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOBEN 1       /**< IO port B clock enable. Set and cleared by software. */
#define HAL_RCC_AHB1ENR_GPIOAEN 0       /**< IO port A clock enable. Set and cleared by software. */

/**
 * @brief: bit definitions for RCC AHB2 peripheral clock enable register (RCC_AHB2ENR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_AHB2ENR_OTGFSEN 7 /**< USB OTG FS clock enable. Set and cleared by software. */
#define HAL_RCC_AHB2ENR_RNGEN 6   /**< Random number generator clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB2ENR_HASHEN 5  /**< Hash modules clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB2ENR_CRYPEN 4  /**< Cryptographic modules clock enable. Set and cleared by software.*/
#define HAL_RCC_AHB2ENR_DCMIEN 0  /**< Camera interface enable. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB3 peripheral clock enable register (RCC_AHB3ENR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_AHB3ENR_FSMCEN 0 /**< Flexible static memory controller module clock enable. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC APB1 peripheral clock enable register (RCC_APB1ENR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_APB1ENR_DACEN 29    /**< DAC interface clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_PWREN 28    /**< Power interface clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_CAN2EN 26   /**< CAN 2 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_CAN1EN 25   /**< CAN 1 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_I2C3EN 23   /**< I2C3 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_I2C2EN 22   /**< I2C2 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_I2C1EN 21   /**< I2C1 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_UART5EN 20  /**< UART5 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_UART4EN 19  /**< UART4 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_USART3EN 18 /**< USART3 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_USART2EN 17 /**< USART2 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_SPI3EN 15   /**< SPI3 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_SPI2EN 14   /**< SPI2 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_WWDGEN 11   /**< Window watchdog clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM14EN 8   /**< TIM14 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM13EN 7   /**< TIM13 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM12EN 6   /**< TIM12 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM7EN 5    /**< TIM7 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM6EN 4    /**< TIM6 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM5EN 3    /**< TIM5 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM4EN 2    /**< TIM4 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM3EN 1    /**< TIM3 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB1ENR_TIM2EN 0    /**< TIM2 clock enable. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC APB2 peripheral clock enable register (RCC_APB2ENR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_APB2ENR_TIM11EN 18  /**< TIM11 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_TIM10EN 17  /**< TIM10 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_TIM9EN 16   /**< TIM9 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_SYSCFGEN 14 /**< System configuration controller clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_SPI1EN 12   /**< SPI1 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_SDIOEN 11   /**< SDIO clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_ADC3EN 10   /**< ADC3 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_ADC2EN 9    /**< ADC2 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_ADC1EN 8    /**< ADC1 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_USART6EN 5  /**< USART6 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_USART1EN 4  /**< USART1 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_TIM8EN 1    /**< TIM8 clock enable. Set and cleared by software.*/
#define HAL_RCC_APB2ENR_TIM1EN 0    /**< TIM1 clock enable. Set and cleared by software.*/

