abdosalem490/stm32f407-drivers/drivers/HAL/RCC/RCC_reg.h
/**
 * @brief: bit definitions for RCC AHB1 peripheral clock enable in low power mode register (RCC_AHB1LPENR), Reset value: 0x7E67 91FF.
 */
#define HAL_RCC_AHB1LPENR_OTGHSULPILPEN 30 /**< USB OTG HS ULPI clock enable during Sleep mode. Set and cleared by software. This bit must be cleared when the OTG_HS is used in FS mode.*/
#define HAL_RCC_AHB1LPENR_OTGHSLPEN 29     /**< USB OTG HS clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_ETHMACPTPLPEN 28 /**< Ethernet PTP clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_ETHMACRXLPEN 27  /**< Ethernet reception clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_ETHMACTXLPEN 26  /**< Ethernet transmission clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_ETHMACLPEN 25    /**< Ethernet MAC clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_DMA2LPEN 22      /**< DMA2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_DMA1LPEN 21      /**< DMA1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_BKPSRAMLPEN 18   /**< Backup SRAM interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_SRAM2LPEN 17     /**< SRAM 2 interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_SRAM1LPEN 16     /**< SRAM 1interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_FLITFLPEN 15     /**< Flash interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_CRCLPEN 12       /**< CRC clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOILPEN 8      /**< IO port I clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOHLPEN 7      /**< IO port H clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOGLPEN 6      /**< IO port G clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOFLPEN 5      /**< IO port F clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOELPEN 4      /**< IO port E clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIODLPEN 3      /**< IO port D clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOCLPEN 2      /**< IO port C clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOBLPEN 1      /**< IO port B clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB1LPENR_GPIOALPEN 0      /**< IO port A clock enable during Sleep mode. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB2 peripheral clock enable in low power mode register (RCC_AHB2LPENR), Reset value: 0x0000 00F1.
 */
#define HAL_RCC_AHB2LPENR_OTGFSLPEN 7 /**< USB OTG FS clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB2LPENR_RNGLPEN 6   /**< Random number generator clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB2LPENR_HASHLPEN 5  /**< Hash modules clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB2LPENR_CRYPLPEN 4  /**< Cryptography modules clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_AHB2LPENR_DCMILPEN 0  /**< Camera interface enable during Sleep mode. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC AHB3 peripheral clock enable in low power mode register (RCC_AHB3LPENR), Reset value: 0x0000 0001.
 */
#define HAL_RCC_AHB3LPENR_FSMCLPEN 0 /**< Flexible static memory controller module clock enable during Sleep mode. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC APB1 peripheral clock enable in low power mode register (RCC_APB1LPENR), Reset value: 0x36FE C9FF.
 */
#define HAL_RCC_APB1LPENR_DACLPEN 29    /**< DAC interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_PWRLPEN 28    /**< Power interface clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_CAN2LPEN 26   /**< CAN 2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_CAN1LPEN 25   /**< CAN 1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_I2C3LPEN 23   /**< I2C3 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_I2C2LPEN 22   /**< I2C2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_I2C1LPEN 21   /**< I2C1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_UART5LPEN 20  /**< UART5 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_UART4LPEN 19  /**< UART4 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_USART3LPEN 18 /**< USART3 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_USART2LPEN 17 /**< USART2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_SPI3LPEN 15   /**< SPI3 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_SPI2LPEN 14   /**< SPI2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_WWDGLPEN 11   /**< Window watchdog clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB1LPENR_TIM14LPEN 8   /**< TIM14 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM13LPEN 7   /**< TIM13 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM12LPEN 6   /**< TIM12 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM7LPEN 5    /**< TIM7 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM6LPEN 4    /**< TIM6 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM5LPEN 3    /**< TIM5 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM4LPEN 2    /**< TIM4 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM3LPEN 1    /**< TIM3 clock enable during Sleep mode*/
#define HAL_RCC_APB1LPENR_TIM2LPEN 0    /**< TIM2 clock enable during Sleep mode*/

/**
 * @brief: bit definitions for RCC APB2 peripheral clock enabled in low power mode (RCC_APB2LPENR), Reset value: 0x0007 5F33.
 */
#define HAL_RCC_APB2LPENR_TIM11LPEN 18  /**< TIM11 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_TIM10LPEN 17  /**< TIM10 clock enable during Sleep mode. Set and cleared by software*/
#define HAL_RCC_APB2LPENR_TIM11LPEN 16  /**< TIM9 clock enable during Sleep mode. Set and cleared by software*/
#define HAL_RCC_APB2LPENR_SYSCFGLPEN 14 /**< System configuration controller clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_SPI1LPEN 12   /**< SPI1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_SDIOLPEN 11   /**< SDIO clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_ADC3LPEN 10   /**< ADC 3 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_ADC2LPEN 9    /**< ADC 2 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_ADC1LPEN 8    /**< ADC 1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_USART6LPEN 5  /**< USART6 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_USART1LPEN 4  /**< USART1 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_TIM8LPEN 1    /**< TIM8 clock enable during Sleep mode. Set and cleared by software.*/
#define HAL_RCC_APB2LPENR_TIM1LPEN 0    /**< TIM1 clock enable during Sleep mode. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC Backup domain control register (RCC_BDCR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_BDCR_BDRST 16 /**< Backup domain software reset. Set and cleared by software. Note: The BKPSRAM is not affected by this reset, the only way of resetting the BKPSRAM is through the Flash interface when a protection level change from level 1 to level 0 is   requested.*/
#define HAL_RCC_BDCR_RTCEN 15 /**< RTC clock enable. Set and cleared by software.*/
#define HAL_RCC_BDCR_RTCSEL 8 /**< RTC clock source selection. Set by software to select the clock source for the RTC. Once the RTC clock source has been selected, it cannot be changed anymore unless the Backup domain is reset. The BDRST bit can be used to reset them.*/
#define HAL_RCC_BDCR_LSEBYP 2 /**< External low-speed oscillator bypass. Set and cleared by software to bypass the oscillator. This bit can be written only when the LSE clock is disabled.*/
#define HAL_RCC_BDCR_LSERDY 1 /**< External low-speed oscillator ready. Set and cleared by hardware to indicate when the external 32 kHz oscillator is stable. After the LSEON bit is cleared, LSERDY goes low after 6 external low-speed oscillator clock cycles.*/
#define HAL_RCC_BDCR_BDRST 0  /**< External low-speed oscillator enable. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC clock control & status register (RCC_CSR), Reset value: 0x0E00 0000.
 */
#define HAL_RCC_CSR_LPWRRSTF 31 /**< Low-power reset flag. Set by hardware when a Low-power management reset occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_WWDGRSTF 30 /**< Window watchdog reset flag. Set by hardware when a window watchdog reset occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_IWDGRSTF 29 /**< Independent watchdog reset flag. Set by hardware when an independent watchdog reset from VDD domain occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_SFTRSTF 28  /**< Software reset flag. Set by hardware when a software reset occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_PORRSTF 27  /**< POR/PDR reset flag. Set by hardware when a POR/PDR reset occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_PINRSTF 26  /**< PIN reset flag. Set by hardware when a reset from the NRST pin occurs. Cleared by writing to the RMVF bit.*/
#define HAL_RCC_CSR_BORRSTF 25  /**< BOR reset flag. Cleared by software by writing the RMVF bit. Cleared by software by writing the RMVF bit.*/
#define HAL_RCC_CSR_RMVF 24     /**< Remove reset flag. Set by software to clear the reset flags.*/
#define HAL_RCC_CSR_LSIRDY 1    /**< Internal low-speed oscillator ready. Set and cleared by hardware to indicate when the internal RC 40 kHz oscillator is stable.  After the LSION bit is cleared, LSIRDY goes low after 3 LSI clock cycles.*/
#define HAL_RCC_CSR_LSION 0     /**< Internal low-speed oscillator enable. Set and cleared by software.*/

/**
 * @brief: bit definitions for RCC spread spectrum clock generation register (RCC_SSCGR), Reset value: 0x0000 0000.
 */
#define HAL_RCC_SSCGR_SSCGEN 31    /**< Spread spectrum modulation enable. Set and cleared by software.*/
#define HAL_RCC_SSCGR_SPREADSEL 30 /**< Spread Select. Set and cleared by software. To write before to set CR[24]=PLLON bit.*/
#define HAL_RCC_SSCGR_INCSTEP 13   /**< Incrementation step. Set and cleared by software. To write before setting CR[24]=PLLON bit. Configuration input for modulation profile amplitude.*/
#define HAL_RCC_SSCGR_MODPER 0     /**< Modulation period. Set and cleared by software. To write before setting CR[24]=PLLON bit. Configuration input for modulation profile period.*/

/**
 * @brief: bit definitions for RCC PLLI2S configuration register (RCC_PLLI2SCFGR), Reset value: 0x2000 3000.
 */
#define HAL_RCC_PLLI2SCFGR_PLLI2SR 28 /**< PLLI2S division factor for I2S clocks. Set and cleared by software to control the I2S clock frequency. These bits should be written  only if the PLLI2S is disabled. The factor must be chosen in accordance with the prescaler values inside the I2S peripherals, to reach 0.3% error when using standard crystals and 0% error with audio crystals.*/
#define HAL_RCC_PLLI2SCFGR_PLLI2SN 6  /**< PLLI2S multiplication factor for VCO. These bits are set and cleared by software to control the multiplication factor of the VCO. These bits can be written only when PLLI2S is disabled. Only half-word and word accesses  are allowed to write these bits.*/

