abdosalem490/stm32f407-drivers/drivers/HAL/RCC/RCC_reg.h
/******************************************************************************
 * Configuration Constants
 *******************************************************************************/

/******************************************************************************
 * Macros
 *******************************************************************************/

/******************************************************************************
 * Typedefs
 *******************************************************************************/

/**
 * @brief: this holds all registers used to configure RCC
 */
typedef struct
{
    __io uint32_t RCC_CR;         /**< RCC clock control register.*/
    __io uint32_t RCC_PLLCFGR;    /**< RCC PLL configuration register. This register is used to configure the PLL clock outputs according to the formulas: 1. f(VCO clock) = f(PLL clock input) × (PLLN / PLLM). 2. f(PLL general clock output) = f(VCO clock) / PLLP. 3. f(USB OTG FS, SDIO, RNG clock output) = f(VCO clock) / PLLQ.*/
    __io uint32_t RCC_CFGR;       /**< RCC clock configuration register. 1 or 2 wait states inserted only if the access occurs during a clock source switch.*/
    __io uint32_t RCC_CIR;        /**< RCC clock interrupt register.*/
    __io uint32_t RCC_AHB1RSTR;   /**< RCC AHB1 peripheral reset register.*/
    __io uint32_t RCC_AHB2RSTR;   /**< RCC AHB2 peripheral reset register.*/
    __io uint32_t RCC_AHB3RSTR;   /**< RCC AHB3 peripheral reset register.*/
    __io uint32_t Reserved1;      /**< Reserved.*/
    __io uint32_t RCC_APB1RSTR;   /**< RCC APB1 peripheral reset register.*/
    __io uint32_t RCC_APB2RSTR;   /**< RCC APB2 peripheral reset register.*/
    __io uint32_t Reserved2[2];   /**< Reserved.*/
    __io uint32_t RCC_AHB1ENR;    /**< RCC AHB1 peripheral clock enable register.*/
    __io uint32_t RCC_AHB2ENR;    /**< RCC AHB2 peripheral clock enable register.*/
    __io uint32_t RCC_AHB3ENR;    /**< RCC AHB3 peripheral clock enable register.*/
    __io uint32_t Reserved3;      /**< Reserved.*/
    __io uint32_t RCC_APB1ENR;    /**< RCC APB1 peripheral clock enable register.*/
    __io uint32_t RCC_APB2ENR;    /**< RCC APB2 peripheral clock enable register.*/
    __io uint32_t Reserved4[2];   /**< Reserved.*/
    __io uint32_t RCC_AHB1LPENR;  /**< RCC AHB1 peripheral clock enable in low power mode register.*/
    __io uint32_t RCC_AHB2LPENR;  /**< RCC AHB2 peripheral clock enable in low power mode register.*/
    __io uint32_t RCC_AHB3LPENR;  /**< RCC AHB3 peripheral clock enable in low power mode register.*/
    __io uint32_t Reserved5;      /**< Reserved.*/
    __io uint32_t RCC_APB1LPENR;  /**< RCC APB1 peripheral clock enable in low power mode register.*/
    __io uint32_t RCC_APB2LPENR;  /**< RCC APB2 peripheral clock enabled in low power mode .*/
    __io uint32_t Reserved6[2];   /**< Reserved.*/
    __io uint32_t RCC_BDCR;       /**< RCC Backup domain control register. */
    __io uint32_t RCC_CSR;        /**< RCC clock control & status register.*/
    __io uint32_t Reserved7[2];   /**< Reserved.*/
    __io uint32_t RCC_SSCGR;      /**< RCC spread spectrum clock generation register. The spread spectrum clock generation is available only for the main PLL. The RCC_SSCGR register must be written either before the main PLL is enabled or after the main PLL disabled.*/
    __io uint32_t RCC_PLLI2SCFGR; /**< RCC PLLI2S configuration register. This register is used to configure the PLLI2S clock outputs according to the formulas: 1. f(VCO clock) = f(PLLI2S clock input) × (PLLI2SN / PLLM). 2. f(PLL I2S clock output) = f(VCO clock) / PLLI2SR. */
} HAL_RCC_RegDef_t;

/******************************************************************************
 * Variables
 *******************************************************************************/
static __io HAL_RCC_RegDef_t *global_pRCCReg_t = ((HAL_RCC_RegDef_t *)(HAL_CM4F_AHB1_BASEADDR + HAL_RCC_OFFSET)); /**< this is a pointer variable through which we will access our RCC registers to configure them*/

/******************************************************************************
 * Function Prototypes
 *******************************************************************************/

/*** End of File **************************************************************/
#endif /*HAL_RCC_REG_H_*/